tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "saulpw/vd"
tap "universal-ctags/universal-ctags"

brew "bat"
brew "cheat"
brew "cmatrix"
brew "coreutils"
brew "diff-so-fancy"
brew "direnv"
brew "dog"
brew "ffmpeg"
brew "figlet"
brew "findutils"
brew "fzf"
brew "git"
brew "graphicsmagick"
brew "htop"
brew "hub"
brew "ipfs"
brew "jq"
brew "logrotate", restart_service: true
brew "macvim"
brew "massren"
brew "mosh"
brew "mpc"
brew "mpd", restart_service: true
brew "mpv"
brew "mtr"
brew "ncdu"
brew "ncmpcpp"
brew "pipes-sh"
brew "ranger"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rename"
brew "rtv"
brew "shellcheck"
brew "saulpw/vd/visidata"
brew "ssh-copy-id"
brew "syncthing", restart_service: true
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tor", restart_service: true
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "watch"

cask "alfred"
cask "appcleaner"
cask "bartender"
cask "choosy"
cask "chromedriver"
cask "dash"
cask "disk-inventory-x"
cask "dropbox"
cask "easy-move-plus-reisze"
cask "fantastical"
cask "firefox"
cask "font-fira-code"
cask "font-victor-mono"
cask "google-chrome"
cask "gpg-suite"
cask "imagealpha"
cask "imageoptim"
cask "keyboard-cleaner"
cask "kitty"
cask "launchcontrol"
cask "malwarebytes"
cask "mediainfo"
cask "miro"
cask "monodraw"
cask "mpv"
cask "obs"
cask "obs-virtualcam"
cask "obsidian"
cask "oversight"
cask "paw"
cask "plex"
cask "plexamp"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "signal"
cask "sony-ps-remote-play"
cask "soulver"
cask "spotify"
cask "steam"
cask "steermouse"
cask "the-unarchiver"
cask "transmit"
cask "tripmode"
cask "tunnelblick"
cask "xld"
